# -*- coding: utf-8 -*-
"""HomeWorkTask

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1DfoEeVnyyld7WysYmNDnAlwnW7amhElC
"""

# Задача 1.1

# Первый трек
my_favorite_songs = ' , '
first_song = my_favorite_songs.split(',')[0]
print(first_song) # Выводит первый трек из списка
# Последний трек
last_song = my_favorite_songs.split(',')[-1]
print(last_song) # Выводит последний трек из списка
# Второй трек
second_song = my_favorite_songs.split(',')[1]
print(second_song) # Выводит второй трек из списка
# Предпоследний трек
second_last_song = my_favorite_songs.split(',')[-2]
print(second_last_song) # Выводит предпоследний трек из списка

# Задача 1.2

# Пункт А
my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]
sum = 0
a = [ ]
for i in my_favorite_songs:
    a.append(i[1])
    sum = sum + i[1] # сумма длительнности всех треков
print(sum)