# -*- coding: utf-8 -*-
"""HomeWorkTask

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1DfoEeVnyyld7WysYmNDnAlwnW7amhElC
"""

# Задача 1.1

# Первый трек
my_favorite_songs = ' , '
first_song = my_favorite_songs.split(',')[0]
print(first_song) # Выводит первый трек из списка
# Последний трек
last_song = my_favorite_songs.split(',')[-1]
print(last_song) # Выводит последний трек из списка
# Второй трек
second_song = my_favorite_songs.split(',')[1]
print(second_song) # Выводит второй трек из списка
# Предпоследний трек
second_last_song = my_favorite_songs.split(',')[-2]
print(second_last_song) # Выводит предпоследний трек из списка

# Задача 1.2

# Пункт А
my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]
sum = 0.0
a = [ ]
for i in my_favorite_songs:
    a.append(i[1])
    sum = sum + i[1] # сумма длительнности всех треков

print('Три песни звучат ' + 'sum ' + 'минут')

# Задача 1.3

n = int(input('Введите номер месяца: '))
if n == 1:
    print('Вы ввели январь.31 дней')
elif n == 2:
    print('Вы ввели февраль.28 дней')
elif n == 3:
    print('Вы ввели март.31 дней')
elif n == 4:
    print('Вы ввели апрель.30 дней')
elif n == 5:
    print('Вы ввели май.31 дней')
elif n == 6:
    print('Вы ввели июнь.30 дней')
elif n == 7:
    print('Вы ввели июль.31 дней')
elif n == 8:
    print('Вы ввели август.31 дней')
elif n == 9:
    print('Вы ввели сентябрь.30 дней')
elif n == 10:
    print('Вы ввели октябрь.31 дней')
elif n == 11:
    print('Вы ввели ноябрь.30 дней')
elif n == 12:
    print('Вы ввели декабрь.31 дней')
else:
    print('Такого месяца нет')